""" 
백준 알고리즘 2775
백준 Online Judge - 문제 - 단계별로 풀어보기 - 규칙 찾기 - 부녀회장이 될 테야

문제)
A평소 반상회에 참석하는 것을 좋아하는 주희는 이번 기회에 부녀회장이 되고 싶어 각 층의 사람들을 불러 모아 반상회를 주최하려고 한다.
이 아파트에 거주를 하려면 조건이 있는데, “a층의 b호에 살려면 자신의 아래(a-1)층의 1호부터 b호까지 사람들의 수의 합만큼 사람들을 데려와 살아야 한다” 는 계약 조항을 꼭 지키고 들어와야 한다.
아파트에 비어있는 집은 없고 모든 거주민들이 이 계약 조건을 지키고 왔다고 가정했을 때, 주어지는 양의 정수 k와 n에 대해 k층에 n호에는 몇 명이 살고 있는지 출력하라. 단, 아파트에는 0층부터 있고 각층에는 1호부터 있으며, 0층의 i호에는 i명이 산다.

입력)
첫 번째 줄에 Test case의 수 T가 주어진다. 그리고 각각의 케이스마다 입력으로 첫 번째 줄에 정수 k, 두 번째 줄에 정수 n이 주어진다. (1 <= k <= 14, 1 <= n <= 14)
2
1
3
2
3

출력)
각각의 Test case에 대해서 해당 집에 거주민 수를 출력하라.
6
10

최초 작성 2019.02.18 PBY
최종 제출 2019.02.19
"""

testcase = int(input())
for tc in range(testcase):
    k = int(input()) # k층
    n = int(input()) # n호
    ans = 0

    pre_nlist = [ i+1 for i in range(n)]  # 이전 층의 정보를 리스트로 저장해두기
    cur_nlist = [0] * n
    for i in range(k):
        for j in range(n):
            cur_nlist[j] = sum(pre_nlist[0:j+1])
        pre_nlist = cur_nlist[:]

    print(cur_nlist[-1])
        # ans += (n-i)*(i+1) # 이것도 2층의 경우만 해당한다.
        # ans += sum(range(1, n+1-i)) * (i+1) # 이건 2층의 경우만 해당한다.

# 0층 1 2 3
# 1층 1 1+2 1+2+3
# 3층 1 1+1+2 1+1+2+1+2+3
# 4층 1 1+1+1+2 1+1+1+2+1+1+2+1+2+3

# pycharm은 실행시 alt+shift+f10 (이전 파일 또 실행 shift+f10)
# visual studio는 실행시 ctrl + f5